Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/supplementary_welfare_schemes/calculating_rent_supplement.html.txt.tmx
Source language: en
Languages: ga

source: • Step 1: Calculate your gross assessable weekly income from all sources
ga: • Céim 1: D’ollioncam seachtainiúil inmheasúnaithe ó gach foinse a ríomh

source: • Step 2: Find out what your income in excess of the SWA rate is
ga: • Céim 2: D’ioncam de bhreis ar an ráta SWA a fháil amach

source: • Step 3: Calculate the Additional Income disregard or Rehabilitative Earnings disregard (if applicable)
ga: • Céim 3: An neamhaird Ioncaim Bhreise nó an neamhaird Tuillimh Athshlánúcháin a ríomh (más infheidhme)

source: • Step 4: Calculate your contribution from means
ga: • Céim 4: Do ranníocaíocht ó acmhainn a ríomh

source: • Step 5: Find your total contribution to your rent
ga: • Céim 5: Do ranníocaíocht iomlán i leith do chíosa a aimsiú

source: • Step 6: Find your Rent Supplement payment
ga: • Céim 6: D’íocaíocht Forlíonadh Cíosa a fháil

source: Before you start to calculate your Rent Supplement you must check whether you qualify
ga: Sula gcuireann tú tús le d’Fhorlíonadh Cíosa a ríomh, ní mór duit a sheiceáil cé acu a cháilíonn tú nach gcáilíonn

source: Make sure you read our document on Rent Supplement
ga: Déan cinnte go léann tú ár gcáipéis faoi Fhorlíonadh Cíosa

source: You should use the worksheet for calculating Rent Supplement with this document
ga: Ba cheart duit úsáid a bhaint as an mbileog oibre le haghaidh Forlíonadh Cíosa a ríomh leis an gcáipéis seo

source: Calculating Rent Supplement is very complex
ga: Tá sé an-chasta Forlíonadh Cíosa a ríomh

source: The Department of Social Protection's (DSP) representative (formerly known as the Community Welfare Officer) will calculate your entitlement to Rent Supplement
ga: Déanfaidh ionadaí (ar ar tugadh an tOifigeach Leasa Pobail roimhe sin) na Roinne Coimirce Sóisialaí (DSP) do theidlíocht i leith Forlíonadh Cíosa a ríomh

source: If you have any questions about your entitlement to Rent Supplement you should contact your local DSP representative
ga: Ba cheart duit dul i dteagmháil le d’ionadaí áitiúil ón Roinn Coimirce Sóisialaí má tá aon cheisteanna agat maidir le do theidlíocht i leith Forlíonadh Cíosa

source: This document shows you the steps involved in calculating Rent Supplement
ga: Léiríonn an cháipéis seo na céimeanna atá i gceist le Forlíonadh Cíosa a ríomh

source: There are 6 steps:
ga: Is ann do 6 chéim:

source: Step 1: Calculate your gross assessable weekly income from all sources
ga: Céim 1: D’ollioncam seachtainiúil inmheasúnaithe ó gach foinse a ríomh

source: Include all income you and your spouse, partner or cohabitant have from DSP payments, Family Income Supplement, employment or training schemes and gross income from employment or self-employment
ga: Cuir san áireamh an t-ioncam ar fad a fhaigheann tusa agus do chéile, do pháirtnéir nó do chomháitritheoir ó íocaíochtaí na Roinne Coimirce Sóisialaí, ón bhForlíonadh ar Ioncam Teaghlaigh, ó scéimeanna fostaíochta agus oiliúna agus ollioncam ó fhostaíocht nó ó fhéinfhostaíocht

source: Include all income from maintenance if applicable
ga: Cuir san áireamh an t-ioncam ar fad ó chothabháil más infheidhme

source: Include any means from capital that you have (see below)
ga: Cuir san áireamh aon acmhainn ó chaipiteal atá agat (féach thíos)

source: Some income is not counted for Supplementary Welfare Allowance (SWA) schemes so you do not need to include it when working out your gross income
ga: Ní áirítear ioncam áirithe le haghaidh scéimeanna Liúntais Leasa Fhorlíontaigh (SWA) agus, dá bhrí sin, ní gá duit é a chur san áireamh agus d’ollioncam á dhéanamh amach agat

source: The following items are not taken into account as income:
ga: Ní chuirtear na míreanna seo a leanas san áireamh mar ioncam:

source: • Foster care payments from the Health Service Executive
ga: • Íocaíochtaí cúram altrama ó Fheidhmeannacht na Seirbhíse Sláinte

source: • Payments for accommodating children under the Child Care Act
ga: • Íocaíochtaí as cóiríocht a chur ar fáil do leanaí faoin Acht um Chúram Leanaí

source: • Income from Gaeltacht students
ga: • Ioncam ó dhaltaí Gaeltachta

source: • Grants or allowances from schemes promoting the welfare of blind people
ga: • Deontais nó liúntais ó scéimeanna a chuireann leas daoine dalla chun cinn

source: • Money received from charitable organisations, for example, St Vincent de Paul
ga: • Airgead a fhaightear ó chumainn charthanachta, mar shampla, Naomh Uinseann de Pól

source: • Compensation awarded by the Compensation Tribunal in respect of Hepatitis C contracted from certain blood products, to those who have disabilities caused by Thalidomide and to those receiving compensation under the Residential Institutions Redress Board
ga: • Cúiteamh a dhámhann an Binse Cúitimh maidir le Heipitíteas C a tolgadh ó tháirgí fola áirithe, dóibh sin a bhfuil míchumas orthu de dheasca Tailídimíde, agus dóibh sin a fhaigheann cúiteamh faoin mBord Sásamh d’Institiúidí Cónaithe

source: • Maintenance grants paid for educational purposes
ga: • Deontais chothabhála a íoctar chun críocha oideachais

source: • Guardian's Payment (Contributory) and Guardian's Payment (Non-Contributory)
ga: • Íocaíocht Chaomhnóra (Ranníocach) agus Íocaíocht Chaomhnóra (Neamh-ranníocach)

source: From January 2012 income from working as a home help with the HSE is taken into account
ga: Ó mhí Eanáir 2012, cuirtear ioncam ó oibriú mar chúntóir baile le FSS san áireamh

source: The capital value of property (except your own home), investments and savings are assessed on a weekly basis as follows:
ga: Measúnaítear an luach caipitiúil réadmhaoine (gan do theach féin a áireamh), infheistíochtaí agus coigiltis ar bhonn seachtainiúil mar seo a leanas:

source: First €5,000 is not taken into account
ga: Ní chuirtear an chéad €5,000 san áireamh

source: Next €10,000 is assessed at €1 per €1,000
ga: Measúnaítear an chéad €10,000 eile ag €1 sa €1,000

source: Next €25,000 is assessed at €2 per €1,000
ga: Measúnaítear an chéad €25,000 eile ag €2 sa €1,000

source: Any capital over €40,000 is assessed at €4 per €1,000
ga: Measúnaítear aon chaipiteal os cionn €40,000 ag €4 sa €1,000

source: Step 2: Find out what your income in excess of the SWA rate is
ga: Céim 2: D’ioncam de bhreis ar an ráta SWA a fháil amach

source: To do this you deduct the Over 65 disregard, the Carer’s disregard, travel costs, PRSI and the appropriate basic Supplementary Welfare Allowance (SWA) rate for your circumstances from your gross assessable income to find out what your income in excess of the SWA rate is
ga: D’fhonn é sin a dhéanamh, bain an neamhaird os cionn 65 bliain d’aois, an neamhaird do Chúramóirí, costais taistil, ÁSPC agus an ráta bunúsach Liúntais Leasa Fhorlíontaigh (SWA) atá oiriúnach do d’imthosca as d’ollioncam inmheasúnaithe chun d’ioncam de bhreis ar an ráta SWA a fháil amach

source: Over 65 disregard: If you are aged 65 or over (or where one of a couple is of pensionable age) and have a combined household income greater than the rate of SWA appropriate to your household circumstances, you are allowed a disregard
ga: Neamhaird os cionn 65 bliain d’aois: Más rud é go bhfuil tú 65 bliain d’aois nó os a chionn (nó más rud é go bhfuil duine amháin de lánúin ag aois an phinsin) agus gur mó d’ioncam teaghlaigh comhcheangailte ná an ráta SWA atá oiriúnach d’imthosca do theaghlaigh, tá tú i dteideal neamhairde

source: This disregard is equal to the difference between the maximum rate of State Pension (Contributory) appropriate to your circumstances and the rate of SWA appropriate to your circumstances (even if you are not getting a pension)
ga: Is ionann an neamhaird seo agus an difríocht idir uasráta an Phinsin Stáit (Ranníocach) atá oiriúnach do d’imthosca agus an ráta SWA atá oiriúnach do d’imthosca (fiú mura bhfuil pinsean á fháil agat)

source: The effect of this is that a person whose only income is a State pension will pay no more than the minimum household contribution towards their rent
ga: Is é an toradh atá air sin ná go n-íocfaidh duine arb é pinsean Stáit an t-aon ioncam amháin atá aige méid nach mó ná an íos-ranníocaíocht teaghlaigh i leith a chíosa

source: For example, the Over-65 disregard for a person aged 65 or over would be the maximum State Pension (Contributory) rate (€230.60) minus the SWA rate for a single person (€186) which is €44.30
ga: Mar shampla, bheadh an neamhaird os cionn 65 bliain d’aois do dhuine atá 65 bliain d’aois nó os a chionn cothrom le huasráta an Phinsin Stáit (Ranníocach) (€230.60) lúide an ráta SWA do dhuine singil (€186) arb ionann é agus €44.30

source: The Over 65 disregard for a couple who are both aged 66 and getting separate payments or working would be worked out using the maximum State Pension (Contributory) rate for 2 people minus the basic SWA rate for a couple (€460.60 - €310.80 = €149.80)
ga: An neamhaird os cionn 65 bliain d’aois do lánúin atá 66 bliain d’aois agus atá ag fáil íocaíochtaí ar leith nó atá ag obair, dhéanfaí amach í ach úsáid a bhaint as uasráta an Phinsin Stáit (Ranníocach) do bheirt lúide an bunráta SWA do lánúin (€460.60 - €310.80 = €149.80)

source: Their Over 65 disregard would be €149.80
ga: B’ionann a neamhaird os cionn 65 bliain d’aois agus €149.80

source: Carer’s disregard: If you are getting a carer's payment, the amount of Carer's Allowance or Benefit in payment above the appropriate SWA rate for your situation (either the adult dependant rate for a couple or the personal rate for a single person) is not taken into account
ga: Neamhaird do chúramóirí: Más rud é go bhfuil íocaíocht do chúramóirí á fáil agat, ní chuirtear san áireamh méid an Liúntais do Chúramóirí nó an tSochair do Chúramóirí atá á íoc os cionn an ráta SWA atá oiriúnach do d’imthosca (an ráta cleithiúnaí is aosach do lánúin nó an ráta pearsanta do dhuine singil)

source: To get your carer’s disregard you subtract the relevant rate of SWA (either €124.80 or €186) from the actual rate of Carer’s Allowance or Benefit you are getting (not including any Increases for Qualified Children)
ga: D’fhonn do neamhaird do chúramóirí a fháil amach, dealaigh an ráta ábhartha SWA (€124.80 nó €186) ó ráta iarbhír an Liúntais do Chúramóirí nó an tSochair do Chúramóirí atá á fháil agat (gan aon Mhéaduithe le haghaidh Leanaí Cáilithe a áireamh)

source: Your travel costs will vary depending on where you live – ask your local Community Welfare Office for more information
ga: Beidh do chostais taistil éagsúil ag brath ar an áit ina bhfuil tú i do chónaí - iarr ar an Oifig Leasa Pobail is cóngaraí duit tuilleadh faisnéise a chur ar fáil

source: See sample SWA rates for different family groupings and circumstances
ga: Féach rátaí samplacha SWA le haghaidh grúpaí éagsúla teaghlaigh agus imthosca éagsúla

source: The figure for income in excess of the SWA rate is your contribution from means (in addition to your minimum household contribution) if Step 3 does not apply to you
ga: Is ionann an figiúr le haghaidh ioncaim de bhreis ar an ráta SWA agus d’ioncam ó acmhainn (de bhreis ar d’íos-ranníocaíocht teaghlaigh) más rud é nach mbaineann Céim 3 leat

source: Step 3: Calculate the Additional Income disregard or Rehabilitative Earnings disregard (if applicable)
ga: Céim 3: An neamhaird Ioncaim Bhreise nó an neamhaird Tuillimh Athshlánúcháin a ríomh (más infheidhme)

source: The Additional Income disregard is a certain amount of your household income which is not taken into account
ga: Is é is an neamhaird Ioncaim Bhreise ann ná méid áirithe de d’ioncam teaghlaigh nach gcuirtear san áireamh

source: The first €75 of any additional household income above the SWA rate for your circumstances is not taken into account
ga: Ní chuirtear san áireamh an chéad €75 d’aon ioncam teaghlaigh breise a sháraíonn an ráta SWA atá oiriúnach do d’imthosca

source: Also, 25% of your additional household income over €75 is not taken into account
ga: Chomh maith leis sin, ní chuirtear san áireamh 25% den ioncam teaghlaigh breise atá agat os cionn €75

source: There is no upper limit on the amount that can be disregarded
ga: Níl aon uasteorainn leis an méid ar féidir neamhaird a dhéanamh de

source: Additional income includes income from the following:
ga: Áirítear le hioncam breise ioncam ó na nithe seo a leanas:

source: • Part-time employment or part-time self-employment (under 30 hours per week)
ga: • Fostaíocht pháirtaimseartha nó féinfhostaíocht pháirtaimseartha (níos lú ná 30 uair sa tseachtain)

source: • Full-time employment or full-time self-employment (30 hours or over per week) where you are accepted as being in need of accommodation under the Rental Accommodation Scheme
ga: • Fostaíocht lánaimseartha nó féinfhostaíocht lánaimseartha (30 uair sa tseachtain nó níos mó) nuair a ghlactar leis go bhfuil cóiríocht faoin Scéim um Chóiríocht ar Cíos ag teastáil uait

source: • SOLAS training allowances or training provided on behalf of the Department of Education and Skills (for example, YouthReach) and ETB/VEC training,
ga: • Liúntais oiliúna SOLAS nó oiliúint a chuirtear ar fáil thar ceann na Roinne Oideachais agus Scileanna (Ógtheagmháil, mar shampla) agus oiliúint na mBord Oideachais agus Oiliúna/na gCoistí Gairmoideachais,

source: • Back to Work Allowance and the Back to Work Enterprise Allowance
ga: • An Liúntas um Fhilleadh ar Obair agus an Liúntas Fiontraíochta um Fhilleadh ar Obair

source: • The Part-time Job Incentive Scheme
ga: • An Scéim Dreasachta Poist Pháirtaimseartha

source: *Maintenance is assessed as additional income and maintenance payments up to €95.23 per week are assessed in full
ga: *Déantar cothabháil a mheasúnú mar ioncam teaghlaigh breise agus déantar íocaíochtaí cothabhála suas go dtí €95.23 sa tseachtain a mheasúnú ar an iomlán

source: (The reason for this is that the first €95.23 per week of maintenance payments are considered to be a contribution towards your housing expenses.) The Additional Income disregard applies to maintenance payments above this amount
ga: (Is é an chúis leis sin ná go meastar an chéad €95.23 sa tseachtain d’íocaíochtaí cothabhála a bheith ina ranníocaíocht i leith do chostas tithíochta.) Baineann an neamhaird Ioncaim Teaghlaigh le híocaíochtaí cothabhála os cionn an mhéid sin

source: If you are getting maintenance under €95.23 do not include it in this step
ga: Más rud é go bhfuil cothabháil de níos lú ná €95.23 á fáil agat, ná cur san áireamh í sa chéim seo

source: If your maintenance is over €95.23 you should subtract €95.25 and include the excess maintenance when working out your Additional Income disregard
ga: Más rud é go sáraíonn do chothabháil €95.23, ba cheart duit €95.25 a dhealú agus an chothabháil iomarcach a chur san áireamh agus do neamhaird Ioncaim Bhreise á hoibriú amach

source: You work out your additional income using the formula: (A+B) – C or the value of A – whichever is the smallest amount
ga: Oibrítear d’ioncam breise amach ach úsáid a bhaint as an bhfoirmle: (A+B) - C nó luach A - cibé acu is ísle

source: A = income from employment, prescribed employment or training schemes, Family Income Supplement and maintenance payments of over €95.23 a week
ga: A = ioncam ó fhostaíocht, ó fhostaíocht fhorordaithe nó ó scéimeanna oiliúna, ón bhForlíonadh ar Ioncam Teaghlaigh agus ó íocaíochtaí cothabhála atá níos mó ná €95.23 sa tseachtain

source: B = assessable weekly income from all other sources
ga: B = ioncam seachtainiúil inmheasúnaithe ó gach foinse eile

source: C = SWA rate for family circumstances
ga: C = ráta SWA d’imthosca teaghlaigh

source: You subtract PRSI, pension contributions and Revenue-approved income continuance payments from your additional income figure
ga: Dealaigh ÁSPC, ranníocaíochtaí pinsin agus íocaíochtaí leanúnachas ioncaim atá faofa ag na Coimisinéirí Ioncaim ó fhigiúr d’ioncaim bhreise

source: You then subtract €75 and get 25% of the remaining figure
ga: Dealaigh €75 ansin agus faigh 25% den fhigiúr atá fágtha

source: Add €75 and 25% of the subtotal together – this is your Additional Income disregard
ga: Cuir €75 agus 25% den fho-iomlán le chéile - is é seo do neamhaird Ioncaim Bhreise

source: │Mary has 1 child
ga: │Tá leanbh amháin ag Mary

source: She works and earns €385 weekly in a part-time job
ga: Oibríonn sí agus tuilleann sí €385 sa tseachtain i bpost páirtaimseartha

source: She gets a One-Parent Family payment of €95.30 a week and maintenance of €80 a week
ga: Faigheann sí íocaíocht Teaghlach Aontuismitheora €95.30 sa tseachtain agus cothabháil €80 sa tseachtain

source: Her additional income is:│
ga: Is é a hioncam breise:│

source: │Subtract PRSI (4% of €385=€15.40) │
ga: │Dealaigh ÁSPC (4% de €385 = €15.40) │

source: │25% of €174.10 = €43.52 │
ga: │25% de €174.10 = €43.52 │

source: │Mary's Additional Income disregard is €118.52 │
ga: │Is é €118.52 an neamhaird Ioncaim Bhreise atá ag Mary │

source: The Rehabilitative Earnings disregard is up to €120 from rehabilitative training or employment which is not taken into account in the assessment for Rent Supplement
ga: Is é an neamhaird Tuillimh Athshlánúcháin méid suas go dtí €120 ó oiliúint athshlánúcháin nó ó fhostaíocht nach gcuirtear san áireamh sa mheasúnú ar Fhorlíonadh Cíosa

source: All rehabilitative earnings over €120 are taken into account and will affect your Rent Supplement
ga: Cuirtear an tuilleamh athshlánúcháin ar fad os cionn €120 san áireamh agus rachaidh sé i bhfeidhm ar d’Fhorlíonadh Cíosa

source: If your earnings are under €120 then use that figure as your Rehabilitative Earnings disregard
ga: Más rud é go bhfuil do thuilleamh níos lú €120, úsáid an figiúr sin mar neamhaird Tuillimh Athshlánúcháin atá agat

source: If you are working and getting Disability Allowance or Blind Pension you can either use the Rehabilitative Earnings disregard or the Additional Income disregard (but not both)
ga: Más rud é go bhfuil tú ag obair agus ag fáil Liúntas Míchumais nó Phinsean na nDall, is féidir leat an neamhaird Tuillimh Athshlánúcháin nó an neamhaird Ioncaim Bhreise a úsáid (ach ní féidir an dá cheann acu a úsáid)

source: Use whichever is in your best interest
ga: Úsáid cibé acu atá le do leas

source: You should always work out what your Additional Income disregard would be and compare it to your Rehabilitative Earnings disregard
ga: Ba cheart duit oibriú amach a dhéanamh i gcónaí ar an méid a bheadh i do neamhaird Ioncaim Bhreise agus é a chur i gcomparáid le do neamhaird Tuillimh Athshlánúcháin

source: │Jack gets Disability Allowance and earns €180 a week
ga: Is é €120 a neamhaird Tuillimh Athshlánúcháin

source: His Rehabilitative Earnings disregard is €120
ga: B’ionann a neamhaird Ioncaim Bhreise agus €101.75

source: His Additional Income disregard would be €101.75 so it is more beneficial for him to use the Rehabilitative Earnings disregard
ga: Dá bhrí sin, b’fhearr dó úsáid a bhaint as an neamhaird Tuillimh Athshlánúcháin

source: │Petra gets Disability Allowance and earns €70 a week
ga: Bheadh a neamhaird Tuillimh Athshlánúcháin cothrom le €70 sa tseachtain

source: Her Rehabilitative Earnings disregard would be €70 a week
ga: B’ionann a neamhaird Ioncaim Bhreise agus €72

source: Her Additional Income disregard would be €72 so it is more beneficial for her to use the Additional Income disregard.│
ga: Dá bhrí sin, b’fhearr di úsáid a bhaint as an neamhaird Tuillimh Bhreise.│

source: Step 4: Calculate your contribution from means
ga: Céim 4: Do ranníocaíocht ó acmhainn a ríomh

source: You subtract the disregards you calculated in Step 3 from the figure you calculated in Step 2 to get your contribution from means
ga: Dealaigh na neamhairdeanna a ríomh tú i gCéim 3 ón bhfigiúr a ríomh tú i gCéim 2 d’fhonn do ranníocaíocht ó acmhainn a aimsiú

source: Step 5: Find your total contribution to your rent
ga: Céim 5: Do ranníocaíocht iomlán i leith do chíosa a aimsiú

source: Find the total amount you must pay towards your rent
ga: Aimsigh an méid iomlán nach mór duit a íoc i leith do chíosa

source: To do this, add your contribution from means (this is the total figure after Step 4) and your minimum Household contribution
ga: D’fhonn é sin a dhéanamh, cuir do ranníocaíocht ó acmhainn (is é seo an figiúr iomlán tar éis Chéim 4) le d’íos-ranníocaíocht Teaghlaigh

source: In general, a household (this is the claimant and may also include a qualified adult and qualified children) must contribute at least €30 towards rent
ga: Ní mór don teaghlach (is é seo an t-éilitheoir ach is féidir go gcuireann sé duine fásta cáilithe agus leanaí cáilithe san áireamh freisin) ranníocaíocht €30 ar a laghad a dhéanamh i dtreo cíosa

source: If you are one of a couple you contribute €40
ga: Más duine amháin de lánúin thú, déanann tú ranníocaíocht €40

source: The personal rent contribution is reduced from €30 to €10 per week for Rent Supplement recipients who are getting Jobseeker’s Allowance (JA) or Supplementary Welfare Allowance of €100 per week and from €30 to €20 for those who are getting JA of €144
ga: Ní mór do bhaill teaghlaigh neamhchleithiúnacha atá spleách go hiomlán ar íocaíocht leasa shóisialaigh phearsanta ranníocaíocht €30 ar a laghad a dhéanamh freisin

source: For those getting Back to Education Allowance, a Further Education and Training (FET) training allowance or on Youthreach, where the age-related rate of €160 applies, the personal rent contribution is reduced from €30 to €20 a week
ga: Mar sin féin, ní bheidh ort ranníocaíocht €30 a dhéanamh más rud é gur measúnaíodh sochar agus pribhléid in aghaidh d’íocaíochta leasa shóisalaigh

source: Non-dependent household members who are solely dependent on a personal social welfare payment must also contribute at least €30. However, if benefit and privilege has been assessed against your social welfare payment you will not have to contribute €30
ga: Is féidir le hionadaí (ar ar tugadh an tOifigeach Leasa Pobail roimhe sin) na Roinne Coimirce Sóisialaí méid an Fhorlíonta Cíosa le híoc a laghdú trí mhéid atá, ina thuairim féin, iníoctha ag gach ball teaghlaigh neamhchleithiúnach i mbun fostaíochta

source: The DSP's representative (formerly known as the Community Welfare Officer) can reduce the amount of Rent Supplement payable by an amount which, in their opinion, is payable by each non-dependent household member in employment
ga: Is é an gnás agus an cleachtadh ná go ndéantar ioncam inmheasúnaithe an bhaill teaghlaigh neamhchleithiúnaigh (is é sin, ollioncam lúide ÁSPC agus costais taistil chun na hoibre) a roinnt ar an ráta SWA atá oiriúnach dá imthoisc

source: Custom and practice is that the assessable income of the non-dependent household member (that is, gross income less PRSI and travel costs to work) is divided by the appropriate rate of SWA for their situation which is then multiplied by €30 to establish their liability to contribute
ga: Déantar é a iolrú faoi €30 ansin chun a dhliteanas chun ranníocaíocht a dhéanamh

source: │If your 26 year old daughter is living with you and earning €700 per week: │
ga: │Más rud é go bhfuil d’iníon 26 bliain d’aois ina cónaí leat agus ag tuilleamh €700 sa tseachtain:│

source: │Multiply €3.76 by €30 = €112.80 │
ga: │Iolraigh €3.76 trí €30 = €112.80 │

source: │In this case, your Rent Supplement is reduced by €112.80 │
ga: │Sa chás seo, déantar laghdú €112.80 ar d’Fhorlíonadh Cíosa

source: A couple aged over 65 with an income equal or less than the State Pension (Contributory) for their situation will contribute €40 towards their rent
ga: Lánúin atá os cionn 65 bliain d’aois ag a bhfuil ioncam acu atá cothrom leis an bPinsean Stáit (Ranníocach) nó atá níos lú ná an Pinsean Stáit (Ranníocach) dá n-imthoisc, déanfaidh siad ranníocaíocht €40 i leith a gcíosa
